using System.ComponentModel;

namespace Rdpzsd.Models.Dtos.RdpzsdImports.TxtValidationErrorCodes
{
    [Description("Код на грешката")]
    public enum TxtValidationErrorCode
    {
        [Description("Грешен брой колони в реда. Всеки ред трябва да съдържа 30 полета и 29 символа за разделяне на стойностите („|“). Всеки ред започва и завършва без разделител.")]
        WrongColumnCount = 1,

        [Description("Невалиден ЕАН.")]
        InvalidUan = 2,

        [Description("Не е намерено лице с посочения ЕАН.")]
        UanNotFound = 3,

        [Description("Липсва идентификатор на лицето. Трябва да бъде въведен поне един от трите идентификатора -ЕГН/ЛНЧ/ИДН.")]
        MissingIdentificator = 4,

        [Description("Невалидно ЕГН.")]
        InvalidUin = 5,

        [Description("Невалидно ЛНЧ.")]
        InvalidForeignerNumber = 6,

        [Description("Невалидно ИДН.")] 
        InvalidIdnNumber = 7,

        [Description("Полето „Дата на раждане“ е задължително.")]
        BirthDateRequired = 8,

        [Description("Невалидна рождена дата. Формата е (dd.mm.yyyy); стойността трябва да е по-голяма от (текуща дата - 80 години) и по-малка от (текуща дата - 14 години).")]
        InvalidBirthDate = 9,

        [Description("Годината на раждане не съвпада с посочената в ЕГН.")]
        InvalidBirthDateUin = 10,

        [Description("В подавания файл съществува повече от едно лице с посочения ЕАН. Системата не позволява въвеждане/редакцията на данни за едно и също лице два пъти с един и същ файл.")]
        UanNotUniqueInTxt = 11,

        [Description("В подавания файл съществува повече от едно лице с посоченото ЕГН. Системата не позволява въвеждане/редакцията на данни за едно и също лице два пъти с един и същ файл.")]
        UinNotUniqueInTxt = 12,

        [Description("В подавания файл съществува повече от едно лице с посоченото ЛНЧ. Системата не позволява въвеждане/редакцията на данни за едно и също лице два пъти с един и същ файл.")]
        ForeignerNumberNotUniqueInTxt = 13,

        [Description("За посочения ЕАН съществува лице с друго ЕГН.")]
        UinExists = 14,

        [Description("За посочения ЕАН съществува лице с друго ЛНЧ.")]
        ForeignerNumberExists = 15,

        [Description("Полето „Първо име (на кирилица)“ е задължително.")]
        FirstNameRequired = 16,

        [Description("Стойността в полето „Първо име (на кирилица)“ трябва да бъде с големина между 2 и 50 символа.")]
        FirstNameLengthRestriction = 17,

        [Description("Стойността в полето „Първо име (на кирилица)“ може да съдържа само букви на кирилица.")]
        FirstNameCyrillic = 18,

        [Description("Стойността в полето „Бащино име (на кирилица)“ трябва да бъде с големина между 2 и 50 символа.")]
        MiddleNameLengthRestriction = 19,

        [Description("Стойността в полето „Бащино име (на кирилица)“ може да съдържа само букви на кирилица.")]
        MiddleNameCyrillic = 20,

        [Description("Полето „Фамилно име (на кирилица)“ е задължително.")]
        LastNameRequired = 21,

        [Description("Стойността в полето „Фамилно име (на кирилица)“ трябва да бъде с големина между 2 и 50 символа.")]
        LastNameLengthRestriction = 22,

        [Description("Стойността в полето „Фамилно име (на кирилица)“ може да съдържа само букви на кирилица.")]
        LastNameCyrillic = 23,

        [Description("Стойността в полето „Други имена (на кирилица)“ трябва да бъде с големина между 2 и 50 символа.")]
        OtherNamesLengthRestriction = 24,

        [Description("Стойността в полето „Други имена (на кирилица)“ може да съдържа само букви на кирилица.")]
        OtherNamesCyrillic = 25,

        [Description("Полето „Първо име (на латиница)“ е задължително.")]
        FirstNameLatinRequired = 26,

        [Description("Стойността в полето „Първо име (на латиница)“ трябва да бъде с големина между 2 и 50 символа.")]
        FirstNameLatinLengthRestriction = 27,

        [Description("Стойността в полето „Първо име (на латиница)“ може да съдържа само латински букви.")]
        FirstNameLatin = 28,

        [Description("Стойността в полето „Бащино име (на латиница)“ трябва да бъде с големина между 2 и 50 символа.")]
        MiddleNameLatinLengthRestriction = 29,

        [Description("Стойността в полето „Бащино име (на латиница)“ може да съдържа само латински букви.")]
        MiddleNameLatin = 30,

        [Description("Полето „Фамилно име (на латиница)“ е задължително.")]
        LastNameLatinRequired = 31,

        [Description("Стойността в полето „Фамилно име (на латиница)“ трябва да бъде с големина между 2 и 50 символа.")]
        LastNameLatinLengthRestriction = 32,

        [Description("Стойността в полето „Фамилно име (на латиница)“ може да съдържа само латински букви.")]
        LastNameLatin = 33,

        [Description("Стойността в полето „Други имена (на латиница)“ трябва да бъде с големина между 2 и 50 символа.")]
        OtherNamesLatinLengthRestriction = 34,

        [Description("Стойността в полето „Други имена (на латиница)“ може да съдържа само латински букви.")]
        OtherNamesLatin = 35,

        [Description("Полето „Пол“ е задължително.")]
        GenderTypeRequired = 36,

        [Description("Невалидна стойност в полето „Пол“. Валидните стойности са: 1 за мъж и 2 за жена")]
        InvalidGenderType = 37,

        [Description("Полът не съвпада с посоченият в ЕГН.")]
        InvalidGenderTypeByUin = 38,

        [Description("Полето „Лична електронна поща“ е задължително.")]
        EmailRequired = 39,

        [Description("Стойността в полето „Лична електронна поща“ трябва да е с големина между 8 и 50 символа.")]
        EmailLengthRestriction = 40,

        [Description("Невалидна електронна поща.")]
        InvalidEmail = 41,

        [Description("В базата данни съществува лице с посочената електронна поща. Регистъра не позволява две лица да имат еднакви електронни пощи.")]
        EmailNotUnique = 42,

        [Description("В подавания файл съществува повече от едно лице с посочената лична електронна поща. ")]
        EmailNotUniqueInTxt = 43,

        [Description("Полето „Телефонен номер“ е задължително.")]
        PhoneNumberRequired = 44,

        [Description("Невалиден телефонен номер. Стойността в полето „Телефонен номер“ трябва да е с големина между 9 и 18 символа.")]
        InvalidPhoneNumber = 45,

        [Description("Полето „Месторождение – държава“ е задължително.")]
        BirthCountryRequired = 46,

        [Description("Стойността в полето „Месторождение – държава“ трябва да бъде с големина точно 2 символа.")]
        BirthCountryLengthRestriction = 47,

        [Description("Невалидна стойност в полето „Месторождение – държава“. Стойността е съгласно утвърдена номенклатура.")]
        InvalidBirthCountry = 48,

        [Description("Ако държавата на раждане е България, полето „Месторождение - населено място“ е задължително.")]
        BirthSettlementRequired = 49,

        [Description("Невалидна стойност в полето „Месторождение - населено място“. Стойността е съгласно утвърдена номенклатура.")]
        InvalidBirthSettlement = 50,

        [Description("Ако държавата на раждане е различна от България, полето „Месторождение - населено място“ трябва да е празно.")]
        InvalidBirthSettlementByCountry = 51,

        [Description("Стойността в полето „Месторождение - населено място“ трябва да бъде с големина точно 5 символа.")]
        BirthSettlementLengthRestriction = 52,

        [Description("Стойността в полето „Месторождение – област“ трябва да бъде с големина точно 3 символа.")]
        BirthDistrictLengthRestriction = 53,

        [Description("Невалидна стойност в полето „Месторождение – област“. Стойността е съгласно утвърдена номенклатура.")]
        InvalidBirthDistrict = 54,

        [Description("Ако държавата на раждане е България, полето „Месторождение – област“ е задължително.")]
        InvalidBirthDistrictByCountry = 55,

        [Description("Стойността в полето „Месторождение – община“ трябва да бъде с големина точно 5 символа.")]
        BirthMunicipalityLengthRestriction = 56,

        [Description("Невалидна стойност в полето „Месторождение – община“. Стойността е съгласно утвърдена номенклатура.")]
        InvalidBirthMunicipality = 57,

        [Description("Ако държавата на раждане е България , полето „Месторождение – община“ е задължително.")]
        InvalidBirthMunicipalityByCountry = 58,

        [Description("Ако държавата на раждане е различна от България, полето „Месторождение - населено място в чужбина“ е задължително.")]
        ForeignerBirthSettlementRequired = 59,

        [Description("Стойността в полето „Месторождение - населено място в чужбина“ трябва да бъде с големина между 3 и 50 символа.")]
        ForeignerBirthSettlementRestriction = 60,

        [Description("Стойността в полето „Месторождение - населено място в чужбина“ може да съдържа само букви на кирилица.")]
        ForeignerBirthSettlementCyrillic = 61,

        [Description("Ако държавата на раждане е България, полето „Месторождение - населено място в чужбина“ трябва да е празно.")]
        InvalidForeignerBirthSettlementByCountry = 62,

        [Description("Полето „Постоянно местоживеене – държава“ е задължително.")]
        ResidenceCountryRequired = 63,

        [Description("Стойността в полето „Постоянно местоживеене – държава“ трябва да бъде с големина точно 2 символа.")]
        ResidenceCountryLengthRestriction = 64,

        [Description("Невалидна стойност в полето „Постоянно местоживеене – държава“. Стойността е съгласно утвърдена номенклатура.")]
        InvalidResidenceCountry = 65,

        [Description("Ако държавата на постоянно местоживеене е България, полето „Постоянно местоживеене - населено място“ е задължително.")]
        ResidenceSettlementRequired = 66,

        [Description("Стойността в полето „Постоянно местоживеене - населено място“ трябва да бъде с големина точно 5 символа.")]
        ResidenceSettlementLengthRestriction = 67,

        [Description("Невалидна стойност в полето „Постоянно местоживеене - населено място“. Стойността е съгласно утвърдена номенклатура.")]
        InvalidResidenceSettlement = 68,

        [Description("Ако държавата на постоянно местоживеене е различна от България, полето „Постоянно местоживеене - населено място“ трябва да е празно.")]
        InvalidResidenceSettlementByCountry = 69,

        [Description("Стойността в полето „Постоянно местоживеене – област“ трябва да бъде с големина точно 3 символа.")]
        ResindeceDistrictLengthRestriction = 70,

        [Description("Невалидна стойност в полето „Постоянно местоживеене – област“. Стойността е съгласно утвърдена номенклатура.")]
        InvalidResidenceDistrict = 71,

        [Description("Ако държавата на постоянно местоживеене е различна от България, полето „Постоянно местоживеене – област“ трябва да е празно.")]
        InvalidResidenceDistrictByCountry = 72,

        [Description("Стойността в полето „Постоянно местоживеене – община“ трябва да бъде с големина точно 5 символа.")]
        ResidenceMunicipalityLengthRestriction = 73,

        [Description("Невалидна стойност в полето „Постоянно местоживеене – община“. Стойността е съгласно утвърдена номенклатура.")]
        InvalidResidenceMunicipality = 74,

        [Description("Ако държавата на постоянно местоживеене е различна от България, полето „Постоянно местоживеене – община“ трябва да е празно.")]
        InvalidResidenceMunicipalityByCountry = 75,

        [Description("Ако държавата на постоянно местоживеене е България , полето „Постоянно местоживеене - п.к.“ е задължително.")]
        InvalidPostCodeByCountry = 76,

        [Description("Стойността в полето „Постоянно местоживеене - п.к.“ трябва да бъде с големина точно 4 символа.")]
        PostCodeLengthRestriction = 77,

        [Description("Стойността в полето „Постоянно местоживеене - п.к.“ може да съдържа само цифри.")]
        InvalidPostCode = 78,

        [Description("Ако държавата на постоянно местоживеене е различно от България, полето „Постоянно местоживеене – адрес“ трябва да е празно.")]
        InvalidResindeceAddressByCountry = 79,

        [Description("Стойността в полето „Постоянно местоживеене – адрес“ трябва да бъде с големина между 8 и 255 символа.")]
        ResidenceAddressLengthRestriction = 80,

        [Description("Стойността в полето „Постоянно местоживеене – адрес“ може да съдържа само букви на кирилица, интервал, цифри и следните специални символи: „-“ и „№“.")]
        InvalidResidenceAddress = 81,

        [Description("Ако държавата на постоянно местоживеене е различна от България, полето „Постоянно местоживеене - адрес в чужбина“ е задължително.")]
        InvalidForeignerResindeceAddressByCountry = 82,

        [Description("Стойността в полето „Постоянно местоживеене - адрес в чужбина“ трябва да бъде с големина между 8 и 255 символа.")]
        ForeignerResidenceAddressLengthRestriction = 83,

        [Description("Стойността в полето „Постоянно местоживеене - адрес в чужбина“ може да съдържа само латински букви, интервал, цифри и специални символи: „№“, „-“ и „#“.")]
        InvalidForeignerResidenceAddress = 84,

        [Description("Полето „Гражданство“ е задължително.")]
        CitizenshipRequired = 85,

        [Description("Стойността в полето „Гражданство“ трябва да бъде с големина точно 2 символа.")]
        CitizenshipLengthRestriction = 86,

        [Description("Невалидна стойност в полето „Гражданство“. Стойността е съгласно утвърдена номенклатура.")]
        InvalidCitizenship = 87,

        [Description("Стойността в полето „Второ гражданство“ трябва да бъде с големина точно 2 символа.")]
        SecondCitizenshipLengthRestriction = 88,

        [Description("Невалидна стойност в полето „Второ гражданство“. Стойността е съгласно утвърдена номенклатура.")] 
        InvalidSecondCitizenship = 89,

        [Description("В регистъра съществува лице родено в чужбина с посочената дата на раждане, държава на месторождение и без ЕГН или ЛНЧ. Системата не позволява автоматизирано въвеждане на ново такова. Моля, изтрийте записа от файла и го въведете в регистъра ръчно!")]
        IdnBirthPlaceExists = 90,

        [Description("В подавания файл съществува повече от едно лице с посочените ИДН, дата на раждане и държава на месторождение. Системата не позволява въвеждане/редакцията на данни за едно и също лице два пъти с един и същ файл.")]
        IdnBirthPlaceNotUniqueInTxt = 91,

        [Description("Посочения ЕАН не съответства  на един или повече от трите идентификатора - ЕГН/ЛНЧ/ИДН.")]
        UanWithIdentificatorNotFound = 92,

        [Description("Стойностите в полетата „Гражданство“ и „Второ гражданство“ трябва да бъдат различни. Регистъра не позволява едно лице да има две еднакви гражданства.")]
        InvalidCitizenships = 93,

        [Description("Ако стойността в полето „Бащино име (на латиница)“ е попълнена, полето „Бащино име (на кирилица)“ е задължително.")]
        RequiredMiddleNameCyrillic = 94,

        [Description("Ако стойността в полето „Бащино име (на кирилица)“ е попълнена, полето „Бащино име (на латиница)“ е задължително.")]
        RequiredMiddleNameLatin = 95,

        [Description("Ако стойността в полето „Други имена (на латиница)“ е попълнена, полето „Други имена (на кирилица)“ е задължително.")]
        RequiredOtherNamesCyrillic = 96,

        [Description("Ако стойността в полето „Други имена (на кирилица)“ е попълнена, полето „Други имена (на латиница)“ е задължително.")]
        RequiredOtherNamesLatin = 97,
    }
}
